trade_exp/src/InformationRegisters/СпособыМетодыОбеспечения/СпособыМетодыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7613e09a-0570-4383-beea-753740d01cba">
  <name>СпособыМетодыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="2b365089-31eb-47a5-a4db-e10ecc9b38c3">
    <name>МетодОбеспеченияПотребностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44b20b09-231f-4fb1-bbcb-abd7573c8005">
    <name>АлгоритмРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="ad40394f-e977-4c3f-9a8e-21285705eca4">
    <name>МинимальноеКоличествоЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="2ab82e65-edbd-44c9-b8c4-06698df3ba5f">
    <name>МаксимальноеКоличествоЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="b5b7cf79-2605-4697-a09b-6f06fe782168">
    <name>УпаковкаЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="94f41d96-826c-4638-a399-afdc35a3ec43">
    <name>СпособОбеспеченияПотребностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="6804ca88-3b4b-4c33-9bde-a740a3da558b">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="00273654-e2db-4e02-baec-03befe482a40">
    <name>ДатаИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="c310b86b-e983-44f5-898c-8f454e861f73">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a9ad9568-3e89-4a53-84a5-ad1a4430779e">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="91f30faf-0bf8-4f26-91c9-0d1d49df06d0">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="9c288854-3c9d-4fcd-aa23-0fee55b6cbf9">
    <name>ТипОбеспечения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/МетодыОбеспеченияПотребностей/МетодыОбеспеченияПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="879216cd-58f8-4ae5-b494-20f33e3f24f9">
  <name>МетодыОбеспеченияПотребностей</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b74f2748-7203-41df-9f30-f156d7a65a40">
    <name>ЗаказПодЗаказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="123aad71-3991-4419-bc74-de443eb42763">
    <name>ПоддержаниеЗапасаМинМакс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f34bc2fd-7730-4a0a-8c87-9b96562b60a7">
    <name>ПоддержаниеЗапасаНаСрокПоНорме</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="dbf7de1d-d86f-424f-9a63-ba8f28985133">
    <name>ПоддержаниеЗапасаНаСрокПоСтатистике</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d9d89bb4-f2d8-494d-98a7-692ea86d7c8f">
    <name>ПоддержаниеЗапасаПоАлгоритму</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ВариантыИспользованияХарактеристикНоменклатуры/ВариантыИспользованияХарактеристикНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыИспользованияХарактеристикНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ОбщиеДляВидаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОбщиеСДругимВидомНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныеДляНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/InformationRegisters/СпособыМетодыОбеспечения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ВременнаяТаблицаТоварыПоддерживаемогоЗапаса() Экспорт
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СпособыМетодыОбеспечения.Номенклатура КАК Номенклатура,
		|	СпособыМетодыОбеспечения.Характеристика КАК Характеристика,
		|	СпособыМетодыОбеспечения.Склад КАК Склад,
		|	СпособыМетодыОбеспечения.МинимальноеКоличествоЗапаса КАК МинимальноеКоличествоЗапаса,
		|	СпособыМетодыОбеспечения.МаксимальноеКоличествоЗапаса КАК МаксимальноеКоличествоЗапаса,
		|	СпособыМетодыОбеспечения.МетодОбеспеченияПотребностей КАК МетодОбеспеченияПотребностей,
		|	СпособыМетодыОбеспечения.УпаковкаЗаказа КАК УпаковкаЗаказа
		|ПОМЕСТИТЬ ВтТоварыПоддерживаемогоЗапаса
		|ИЗ
		|	РегистрСведений.СпособыМетодыОбеспечения КАК СпособыМетодыОбеспечения
		|ГДЕ
		|	СпособыМетодыОбеспечения.МетодОбеспеченияПотребностей <> ЗНАЧЕНИЕ(Перечисление.МетодыОбеспеченияПотребностей.ЗаказПодЗаказ)
		|	И СпособыМетодыОбеспечения.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И (СпособыМетодыОбеспечения.Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|			ИЛИ СпособыМетодыОбеспечения.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|{ГДЕ
		|	СпособыМетодыОбеспечения.Номенклатура.* КАК Номенклатура,
		|	СпособыМетодыОбеспечения.Характеристика.* КАК Характеристика,
		|	СпособыМетодыОбеспечения.Склад.* КАК Склад}";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецЕсли
